#dictionary를 사용해서 각 숫자가 어떤 위치의 전구가 켜지는지 표현
light ={'0':'1110111',
        '1':'0010010',
        '2':'1011101',
        '3':'1011011',
        '4':'0111010',
        '5':'1101011',
        '6':'1101111',
        '7':'1110010',
        '8':'1111111',
        '9':'1111011',
        ' ':'0000000'}
#자릿수 맞추는 작업을 먼저 해야됨
#입력이 12345 6789 이면 12345 06789 이렇게 받아야 비교가능
t = int(input())
for k in range(t):
    total = 0
    a,b = input().split()
    
    a = (5-len(a))*' ' + a
    b = (5-len(b))*' ' + b
    
    for i in range(5):
        for j in range(7):
            total += (light[a[i]][j] != light[b[i]][j])
    print(total)


